In [19]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib as mpl
mpl.rc('font',family='Malgun Gothic')
mpl.rcParams['axes.unicode_minus'] = False
import seaborn as sns
import scipy.stats as stats

In [2]:
df_TFD = pd.read_csv('../../datasets/TitanicFromDIsaster_train.csv')
df_TFD.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df_TFD.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [9]:
df_TFD.describe(include=object)

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

## quest
- 범주형/범주형, 연속형/연속형 확증 데이터 검증

### 범주형/범주형

#### 선정 변수 : Sex, Embarked
- 분석 내용 : 성별에 따른 탑승위치의 상관관계가 있을까?
    - 귀무가설 : 성별에 따른 탑승위치의 상관관계가 없다.
    - 대립가설 : 성별에 따른 탑승위치의 상관관계가 있다.
- 분석 결론 (기준 : p-value 0.05)
    - 통계 결론 : 대립가설이 참 (statistic=13.355630, pvalue=0.001258)
    - 사실 결론 : 성별에 따른 탑승위치의 상관관계가 있다.

In [10]:
df_TFD[['Sex', 'Embarked']].isnull().sum()

Sex         0
Embarked    2
dtype: int64

In [15]:
df_TFD_Sex = df_TFD[['Sex', 'Embarked']].dropna().copy()
df_TFD_Sex[:3]

      Sex Embarked
0    male        S
1  female        C
2  female        S

In [14]:
df_TFD_Sex.isnull().sum()

Sex         0
Embarked    0
dtype: int64

In [17]:
df_TFD_Sex_pivot = pd.pivot_table(data=df_TFD_Sex, index='Sex'
                                       , columns='Embarked', aggfunc=len).copy()
df_TFD_Sex_pivot

Embarked   C   Q    S
Sex
female    73  36  203
male      95  41  441

In [20]:
stats.chi2_contingency(observed=df_TFD_Sex_pivot, correction=True)

Chi2ContingencyResult(statistic=13.355630515001746, pvalue=0.0012585245232290144, dof=2, expected_freq=array([[ 58.96062992,  27.02362205, 226.01574803],
       [109.03937008,  49.97637795, 417.98425197]]))

### 연속형/연속형

#### 선정 변수 : SibSp, Age
- 분석 내용 : 나이에 따른 형제와와이프의 상관관계가 있는가?
    - 귀무가설 : 나이에 따른 형제와와이프의 상관관계가 없다.
    - 대립가설 : 나이에 따른 형제와와이프의 상관관계가 있다.
- 분석 결론 (기준 : p-value 0.05)
    - 통계 결론 : 대립가설이 참(statistic=-0.30824, pvalue=3.5090251937842815e-17)
    - 사실 결론 : 나이에 따른 형제와와이프의 상관관계가 있다.

In [33]:
df_TFD.describe()[:3]

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429

In [34]:
df_TFD_Age = df_TFD[['SibSp', 'Age']]
df_TFD_Age[:3]

   SibSp   Age
0      1  22.0
1      1  38.0
2      0  26.0

In [35]:
df_TFD_Age.isnull().sum()

SibSp      0
Age      177
dtype: int64

In [36]:
df_Age_dropna = df_TFD_Age.dropna().copy()
df_Age_dropna[:3]

   SibSp   Age
0      1  22.0
1      1  38.0
2      0  26.0

In [37]:
df_Age_dropna.isnull().sum()

SibSp    0
Age      0
dtype: int64

In [38]:
stats.pearsonr(df_Age_dropna['SibSp'],df_Age_dropna['Age'])

PearsonRResult(statistic=-0.3082467589236567, pvalue=3.5090251937842815e-17)